Revit 2026 API

# FieldBuilderReady Method

---

Checks whether the builder may be used.

**Namespace:** Autodesk.Revit.DB.ExtensibleStorage**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool Ready()
```
```vb
Public Function Ready As Boolean
```
```cpp
public:
bool Ready()
```
```fsharp
member Ready : unit -> bool
```

#### Return Value

Boolean True if the SchemaBuilder has not yet been finished.

All newly constructed FieldBuilders are usable until the call to the Finish method of the constructing SchemaBuilder.

#### Reference

FieldBuilder Class

Autodesk.Revit.DB.ExtensibleStorage Namespace